{
  "add_prefix_space": true,
  "backend": "tokenizers",
  "bos_token": "<|endoftext|>",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<|endoftext|>",
  "extra_special_tokens": [
    "<|im_start|>",
    "<|im_end|>",
    "<fim_prefix>",
    "<fim_middle>",
    "<fim_suffix>",
    "<fim_pad>"
  ],
  "is_local": false,
  "legacy": false,
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<|endoftext|>",
  "sp_model_kwargs": {},
  "spaces_between_special_tokens": false,
  "tokenizer_class": "TokenizersBackend",
  "unk_token": "<unk>",
  "use_default_system_prompt": false
}
